app/controllers/v1/ingredients_controller.rb

    def set_recipe
      @recipe = Recipe.find(params[:recipe_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

    def set_recipe_ingredient
      @ingredient = @recipe.ingredients.find_by!(id: params[:id]) if @recipe
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 18]]