app/controllers/v1/recipes_controller.rb

INSERT INTO "recipes" ("name", "description", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "testing"], ["description", "let see what hapens here"], ["time", 1384], ["created_at", 2017-10-10 04:13:44 UTC], ["updated_at", 2017-10-10 04:13:44 UTC]]
INSERT INTO "ingredients" ("name", "amount", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asd"], ["amount", "23"], ["recipe_id", 70], ["created_at", 2017-10-10 05:44:25 UTC], ["updated_at", 2017-10-10 05:44:25 UTC]]
---
    def create
      @recipe = Recipe.create!(recipe_params)
      params[:ingredients].each do |ingredient|
        @recipe.ingredients.create!(:amount => ingredient[:amount], :name => ingredient[:name])

UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "est lkj"], ["updated_at", 2017-10-10 06:26:33 UTC], ["id", 2]]
---
    def update
      @recipe.update(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."recipe_id" = ? LIMIT ?  [["recipe_id", "18"], ["LIMIT", 1]]
---
    def set_recipe
      @recipe = Recipe.find_by(id: params[:id])