app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    # get current user todos
    @users = User.all.paginate(page: params[:page], per_page: 20)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "foo@bar.com"], ["LIMIT", 1]]
---
  def set_user
    # TODO: maybe not done
    @user = User.find_by(email: params[:email])